app/controllers/sales_controller.rb

SELECT "sales".* FROM "sales"
---
  def index
    @sales = Sale.all

INSERT INTO "sales" ("sale", "sale2", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sale", "retetert"], ["sale2", "erterterterte"], ["created_at", "2022-09-06 13:01:33.722153"], ["updated_at", "2022-09-06 13:01:33.722153"]]
---
  def create
    @sale = Sale.new(sale_params)

    respond_to do |format|
      if @sale.save

UPDATE "sales" SET "sale" = $1, "sale2" = $2, "updated_at" = $3 WHERE "sales"."id" = $4  [["sale", "000000000"], ["sale2", "00000000000"], ["updated_at", "2022-09-06 13:02:12.936222"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @sale.update(sale_params)

SELECT "sales".* FROM "sales" WHERE "sales"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_sale
      @sale = Sale.find(params[:id])